# InitialIntensity Properties

---
The InitialIntensity type exposes the following members.
| Name| Description
---|---|---
| InitialIntensityValue|  The calculated initial intensity value.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
InitialIntensity Class
Autodesk.Revit.DB.Lighting Namespace